In [100]:
# 라이브러리를 불러옵니다.
import pandas as pd
import numpy as np

In [101]:
# 데이터 프레임은 시리즈와 약간은 다른 형태입니다.
city_data = {
    'City':['New York City', 'Paris', 'Barcelona', 'Rome'],
    'Country':['United States', 'France', 'Spain', 'Italy'],
    'Population':[8600000, 2141000, 5515000, 2873000]
}
cities = pd.DataFrame(city_data)
cities.head()

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [102]:
# transpose 함수는 전치로, 뒤집는다고 생각하면 됩니다.
cities.transpose()
cities.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [103]:
# 임의의 배열을 만들고, 데이터 프레임에 넣어볼게요.
random_data = np.random.randint(low=1, high=101, size=(3, 5))
pd.DataFrame(random_data)

    0   1   2   3   4
0   4  30  52   8  18
1  76  82   6  95  61
2   5  74   2  81  57

In [105]:
# index를 추가하고,
row_labels = ['Morning', 'Afternoon', 'Evening']
pd.DataFrame(data=random_data,
             index=row_labels)

            0   1   2   3   4
Morning     4  30  52   8  18
Afternoon  76  82   6  95  61
Evening     5  74   2  81  57

In [106]:
# 칼럼을 추가해서 하나의 데이터 프레임을 만듭시다.
column_lables = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri']
pd.DataFrame(data=random_data,
             index=row_labels,
             columns=column_lables)

           Mon  Tue  Wed  Thur  Fri
Morning      4   30   52     8   18
Afternoon   76   82    6    95   61
Evening      5   74    2    81   57

In [107]:
# 농구선수 데이터를 불러오죠.
pd.read_csv('nba.csv').head()

             Name                Team Position Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  9/26/96  1445697
1  Christian Wood     Detroit Pistons       PF  9/27/95  1645357
2   PJ Washington   Charlotte Hornets       PF  8/23/98  3831840
3    Derrick Rose     Detroit Pistons       PG  10/4/88  7317074
4   Marial Shayok  Philadelphia 76ers        G  7/26/95    79568

In [108]:
# Birthday 값을 datetime 형태로 지정할게요.
pd.read_csv(filepath_or_buffer='nba.csv',
            parse_dates=['Birthday']).head()

/var/folders/yd/4k8th6097mb8w26m8__j7j140000gn/T/ipykernel_60675/3107837513.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.read_csv(filepath_or_buffer='nba.csv',

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [109]:
# 이제 이걸 변수에 저장합시다.
nba = pd.read_csv(filepath_or_buffer='nba.csv',
                  parse_dates=['Birthday'])

/var/folders/yd/4k8th6097mb8w26m8__j7j140000gn/T/ipykernel_60675/950417815.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv(filepath_or_buffer='nba.csv',

In [110]:
# Series는 하나의 열이였지만,
pd.Series([1, 2, 3]).dtype

dtype('int64')

In [111]:
# Dataframe은 여러개의 열의 집합으로 이루어져있습니다.
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [112]:
# object는 str이고, datetime은 날짜, int는 정수입니다.
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
Name: count, dtype: int64

In [113]:
# nba의 인덱스가 0부터 시작해서 450까지 1씩 커진다는 이야기랍니다.
nba.index

RangeIndex(start=0, stop=450, step=1)

In [114]:
# nba의 칼럼들을 나타내고요.
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [115]:
# 해당 데이터프레임의 차원은 2차원이군요.
nba.ndim

2

In [116]:
# 450개의 데이터가 5개의 특성을 포함하고 있습니다.
nba.shape

(450, 5)

In [117]:
# 총 데이터가 2250개이고요.
nba.size

2250

In [118]:
# axis 0은 행방향(세로)으로 개수를 세는데 각 열의 데이터가 450개라는 이야기입니다.
nba.count(axis=0)

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [119]:
data = {
    'A':[1, np.nan],
    'B':[2, 3]
}
df = pd.DataFrame(data)
df

     A  B
0  1.0  2
1  NaN  3

In [120]:
df.size

4

In [121]:
# count 함수는 NAN의 값은 취급하지 않습니다.
df.count()

A    1
B    2
dtype: int64

In [122]:
# 결측치 아닌것 총 3개
df.count().sum()

np.int64(3)

In [123]:
# sample 함수는 표본 n개를 추출합니다.
nba.sample(3)

             Name               Team Position   Birthday   Salary
311   Cody Martin  Charlotte Hornets       SF 1995-09-28  1173310
322  Josh Magette      Orlando Magic       PG 1989-11-28    79568
436    Dante Exum          Utah Jazz       PG 1995-07-13  9600000

In [124]:
# 각 열이 어떤 값들을 가지고 있는지를 반환합니다.
# 450개의 서로 다른 이름이 있고
# 30개의 팀, 9개의 포지션이 있네요.
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [125]:
# 가장 큰 4개의 값을 반환합니다.
nba.nlargest(n=4, columns='Salary')

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000

In [126]:
# 가장 작은 값 3개를 반환합니다.
nba.nsmallest(n=3, columns=['Birthday'])

              Name             Team Position   Birthday   Salary
98    Vince Carter    Atlanta Hawks       PF 1977-01-26  2564753
196  Udonis Haslem       Miami Heat        C 1980-06-09  2564753
262    Kyle Korver  Milwaukee Bucks       PF 1981-03-17  6004753

In [127]:
# 타입이 숫자형인 데이터만 반환합니다.
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [129]:
# 이름을 기준으로 정렬합니다.
nba.sort_values(by='Name').head()

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [130]:
# 역순으로 정렬합니다.
nba.sort_values(by='Name',
                ascending=False).head()

                Name                  Team Position   Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17     79568
137  Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
312     Zhaire Smith    Philadelphia 76ers       SG 1999-06-04   3058800
302     Zach Norvell    Los Angeles Lakers       SG 1997-12-09     79568
159      Zach LaVine         Chicago Bulls       PG 1995-03-10  19500000

In [131]:
# 팀을 기준으로 정렬하는데 동일하다면 Name순서대로 정렬합니다.
nba.sort_values(by=['Team', 'Name']).head()

                Name           Team Position   Birthday    Salary
359         Alex Len  Atlanta Hawks        C 1993-06-16   4160000
167     Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
276  Brandon Goodwin  Atlanta Hawks       PG 1995-10-02     79568
438   Bruno Fernando  Atlanta Hawks        C 1998-08-15   1400000
194      Cam Reddish  Atlanta Hawks       SF 1999-09-01   4245720

In [133]:
# Team으로 정렬하는데 동일하다면 Salary를 오름차순으로 정렬하라는 의미입니다.
nba.sort_values(by=['Team', 'Salary'],
                ascending=[True, False]).head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

In [134]:
# 해당 배열을 저장해줍시다.
nba = nba.sort_values(by=['Team', 'Salary'],
                      ascending=[True, False])

In [135]:
# 인덱스를 설정할 수 있습니다.
nba.set_index(keys='Name').head()

                           Team Position   Birthday    Salary
Name
Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
Evan Turner       Atlanta Hawks       PG 1988-10-27  18606556
Allen Crabbe      Atlanta Hawks       SG 1992-04-09  18500000
De'Andre Hunter   Atlanta Hawks       SF 1997-12-02   7068360
Jabari Parker     Atlanta Hawks       PF 1995-03-15   6500000

In [136]:
# inplace로 nba의 값을 바꿔버리죠.
nba.set_index(keys='Name',
              inplace=True)

In [137]:
# .Salary와 같이 특정 칼럼에 접근할 수 있습니다.
nba.Salary

Name
Chandler Parsons     25102512
Evan Turner          18606556
Allen Crabbe         18500000
De'Andre Hunter       7068360
Jabari Parker         6500000
                       ...
Isaac Bonga           1416852
Admiral Schofield     1000000
Justin Robinson        898310
Garrison Mathews        79568
Chris Chiozza           79568
Name: Salary, Length: 450, dtype: int64

In [138]:
# 아래 형식으로도 접근할 수 있구요.
nba['Position']

Name
Chandler Parsons     SF
Evan Turner          PG
Allen Crabbe         SG
De'Andre Hunter      SF
Jabari Parker        PF
                     ..
Isaac Bonga          PG
Admiral Schofield    SF
Justin Robinson      PG
Garrison Mathews     SG
Chris Chiozza        PG
Name: Position, Length: 450, dtype: object

In [139]:
# 특정 dtypes만 선택할 수 있습니다.
nba.select_dtypes(include='object').head()

                           Team Position
Name
Chandler Parsons  Atlanta Hawks       SF
Evan Turner       Atlanta Hawks       PG
Allen Crabbe      Atlanta Hawks       SG
De'Andre Hunter   Atlanta Hawks       SF
Jabari Parker     Atlanta Hawks       PF

In [140]:
# 다수의 dtypes에 접근할 수 있습니다.
nba.select_dtypes(include=['int', 'object'])

                                 Team Position    Salary
Name
Chandler Parsons        Atlanta Hawks       SF  25102512
Evan Turner             Atlanta Hawks       PG  18606556
Allen Crabbe            Atlanta Hawks       SG  18500000
De'Andre Hunter         Atlanta Hawks       SF   7068360
Jabari Parker           Atlanta Hawks       PF   6500000
...                               ...      ...       ...
Isaac Bonga        Washington Wizards       PG   1416852
Admiral Schofield  Washington Wizards       SF   1000000
Justin Robinson    Washington Wizards       PG    898310
Garrison Mathews   Washington Wizards       SG     79568
Chris Chiozza      Washington Wizards       PG     79568

[450 rows x 3 columns]

In [141]:
# loc는 특정 index에 접근합니다.
nba.loc['Evan Turner']

Team              Atlanta Hawks
Position                     PG
Birthday    1988-10-27 00:00:00
Salary                 18606556
Name: Evan Turner, dtype: object

In [142]:
nba.loc[['Justin Robinson', 'Chris Chiozza']]

                               Team Position   Birthday  Salary
Name
Justin Robinson  Washington Wizards       PG 1997-10-12  898310
Chris Chiozza    Washington Wizards       PG 1995-11-21   79568

In [143]:
# 구간 인덱싱을 설정할 수도 있구요.
nba.loc['Isaac Bonga':'Chris Chiozza']

                                 Team Position   Birthday   Salary
Name
Isaac Bonga        Washington Wizards       PG 1999-11-08  1416852
Admiral Schofield  Washington Wizards       SF 1997-03-30  1000000
Justin Robinson    Washington Wizards       PG 1997-10-12   898310
Garrison Mathews   Washington Wizards       SG 1996-10-24    79568
Chris Chiozza      Washington Wizards       PG 1995-11-21    79568

In [144]:
# iloc는 특정 행의 위치에 접근합니다.
nba.iloc[300]

Team            New York Knicks
Position                     PF
Birthday    1997-02-04 00:00:00
Salary                    79568
Name: Ivan Rabb, dtype: object

In [145]:
nba.iloc[[100, 200, 300, 400]]

                                   Team Position   Birthday   Salary
Name
Dorian Finney-Smith    Dallas Mavericks       PF 1993-05-04  4000000
DeMarcus Cousins     Los Angeles Lakers        C 1990-08-13  3500000
Ivan Rabb               New York Knicks       PF 1997-02-04    79568
Chimezie Metu         San Antonio Spurs       PF 1997-03-22  1416852

In [146]:
# iloc도 마찬가지로 인덱싱을 지원하고요.
nba.iloc[400:404]

                                     Team Position   Birthday    Salary
Name
Chimezie Metu           San Antonio Spurs       PF 1997-03-22   1416852
Quinndary Weatherspoon  San Antonio Spurs        G 1996-09-10     79568
Drew Eubanks            San Antonio Spurs       PF 1997-02-01     79568
Kyle Lowry                Toronto Raptors       PG 1986-03-25  33296296

In [147]:
# 역순으로 배열시키라는 의미입니다.
nba.iloc[::-1]

                                 Team Position   Birthday    Salary
Name
Chris Chiozza      Washington Wizards       PG 1995-11-21     79568
Garrison Mathews   Washington Wizards       SG 1996-10-24     79568
Justin Robinson    Washington Wizards       PG 1997-10-12    898310
Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000
Isaac Bonga        Washington Wizards       PG 1999-11-08   1416852
...                               ...      ...        ...       ...
Jabari Parker           Atlanta Hawks       PF 1995-03-15   6500000
De'Andre Hunter         Atlanta Hawks       SF 1997-12-02   7068360
Allen Crabbe            Atlanta Hawks       SG 1992-04-09  18500000
Evan Turner             Atlanta Hawks       PG 1988-10-27  18606556
Chandler Parsons        Atlanta Hawks       SF 1988-10-25  25102512

[450 rows x 4 columns]

In [148]:
# loc에서 특정 칼럼만 받아올때, .loc[인덱스, 칼럼]의 형태로 사용됩니다.
nba.loc['Kyle Lowry', 'Position']

'PG'

In [149]:
nba.loc['Kyle Lowry', ['Position', 'Birthday']]

Position                     PG
Birthday    1986-03-25 00:00:00
Name: Kyle Lowry, dtype: object

In [150]:
nba.loc[['Allen Crabbe', 'Evan Turner'], ['Position', 'Birthday']]

             Position   Birthday
Name
Allen Crabbe       SG 1992-04-09
Evan Turner        PG 1988-10-27

In [151]:
nba.loc['Allen Crabbe', 'Position':'Salary']

Position                     SG
Birthday    1992-04-09 00:00:00
Salary                 18500000
Name: Allen Crabbe, dtype: object

In [152]:
# at는 단일 값을 가져옵니다.
nba.at['Allen Crabbe', 'Birthday']

Timestamp('1992-04-09 00:00:00')

In [153]:
# 특정 인덱스 단일값에 접근합니다.
nba.iat[0, 0]

'Atlanta Hawks'

In [155]:
# 해당 %%timeit을 사용해 아래 함수가 사용되는 시간을 측정할 수 있습니다.
%%timeit
nba.at['Allen Crabbe', 'Salary']

UsageError: Line magic function `%%timeit` not found.

In [156]:
%%timeit
nba.iat[263, 1]

7.05 µs ± 32.8 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [83]:
nba['Salary'].loc['Evan Turner']

np.int64(18606556)

In [84]:
nba['Salary'].at['Damian Lillard']

np.int64(29802321)

In [85]:
nba.columns

Index(['Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [88]:
nba.columns=['Team', 'Position', 'Date of Birth', 'Pay']

In [89]:
nba.head()

                           Team Position Date of Birth       Pay
Name
Chandler Parsons  Atlanta Hawks       SF    1988-10-25  25102512
Evan Turner       Atlanta Hawks       PG    1988-10-27  18606556
Allen Crabbe      Atlanta Hawks       SG    1992-04-09  18500000
De'Andre Hunter   Atlanta Hawks       SF    1997-12-02   7068360
Jabari Parker     Atlanta Hawks       PF    1995-03-15   6500000

In [91]:
nba.rename(columns={'Date of Birth':'Birthday'}, inplace=True)

In [92]:
nba

                                 Team Position   Birthday       Pay
Name
Chandler Parsons        Atlanta Hawks       SF 1988-10-25  25102512
Evan Turner             Atlanta Hawks       PG 1988-10-27  18606556
Allen Crabbe            Atlanta Hawks       SG 1992-04-09  18500000
De'Andre Hunter         Atlanta Hawks       SF 1997-12-02   7068360
Jabari Parker           Atlanta Hawks       PF 1995-03-15   6500000
...                               ...      ...        ...       ...
Isaac Bonga        Washington Wizards       PG 1999-11-08   1416852
Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000
Justin Robinson    Washington Wizards       PG 1997-10-12    898310
Garrison Mathews   Washington Wizards       SG 1996-10-24     79568
Chris Chiozza      Washington Wizards       PG 1995-11-21     79568

[450 rows x 4 columns]

In [93]:
nba.reset_index()

                  Name                Team Position   Birthday       Pay
0     Chandler Parsons       Atlanta Hawks       SF 1988-10-25  25102512
1          Evan Turner       Atlanta Hawks       PG 1988-10-27  18606556
2         Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
3      De'Andre Hunter       Atlanta Hawks       SF 1997-12-02   7068360
4        Jabari Parker       Atlanta Hawks       PF 1995-03-15   6500000
..                 ...                 ...      ...        ...       ...
445        Isaac Bonga  Washington Wizards       PG 1999-11-08   1416852
446  Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000
447    Justin Robinson  Washington Wizards       PG 1997-10-12    898310
448   Garrison Mathews  Washington Wizards       SG 1996-10-24     79568
449      Chris Chiozza  Washington Wizards       PG 1995-11-21     79568

[450 rows x 5 columns]

In [99]:
nba.set_index('Team')

                                 Name Position   Birthday       Pay
Team
Atlanta Hawks        Chandler Parsons       SF 1988-10-25  25102512
Atlanta Hawks             Evan Turner       PG 1988-10-27  18606556
Atlanta Hawks            Allen Crabbe       SG 1992-04-09  18500000
Atlanta Hawks         De'Andre Hunter       SF 1997-12-02   7068360
Atlanta Hawks           Jabari Parker       PF 1995-03-15   6500000
...                               ...      ...        ...       ...
Washington Wizards        Isaac Bonga       PG 1999-11-08   1416852
Washington Wizards  Admiral Schofield       SF 1997-03-30   1000000
Washington Wizards    Justin Robinson       PG 1997-10-12    898310
Washington Wizards   Garrison Mathews       SG 1996-10-24     79568
Washington Wizards      Chris Chiozza       PG 1995-11-21     79568

[450 rows x 4 columns]